In [19]:
import pandas as pd
import numpy as np

In [20]:
# TASK - 1

In [21]:
data = [25, 30, 35, 40, 45]
series = pd.Series(data, index=['A', 'B', 'C', 'D', 'E'])
print(series)

A    25
B    30
C    35
D    40
E    45
dtype: int64

In [22]:
print('First three :\n',series.head(3))

First three :
 A    25
B    30
C    35
dtype: int64

In [23]:
mean = series.mean()
med = series.median()
std = series.std()

print("Mean :",mean)
print('Median :',med)
print("Standard Deviation ;",std)

Mean : 35.0
Median : 35.0
Standard Deviation ; 7.905694150420948

In [24]:
# TASK - 2

In [31]:
data = {
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [20, 22, 19, 21, 20],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Marks': [85, 78, 92, 74, 88]
}

df = pd.DataFrame(data)
df

    Name  Age  Gender  Marks
0  Alice   20  Female     85
1    Bob   22    Male     78
2  Carol   19  Female     92
3  David   21    Male     74
4    Eve   20  Female     88

In [ ]:
print("First two row:\n")
df.head(2)

First two row:

    Name  Age  Gender  Marks  Passed
0  Alice   20  Female     85    True
1    Bob   22    Male     78   False

In [35]:
print("Column Names:", df.columns.tolist())
print()
print("Data Types:\n", df.dtypes)

Column Names: ['Name', 'Age', 'Gender', 'Marks']

Data Types:
 Name      object
Age        int64
Gender    object
Marks      int64
dtype: object

In [39]:
print("Summary Statistics")
df.describe()

Summary Statistics

             Age      Marks
count   5.000000   5.000000
mean   20.400000  83.400000
std     1.140175   7.334848
min    19.000000  74.000000
25%    20.000000  78.000000
50%    20.000000  85.000000
75%    21.000000  88.000000
max    22.000000  92.000000

In [ ]:
df['Passed'] = df['Marks'] >= 80
df

    Name  Age  Gender  Marks  Passed
0  Alice   20  Female     85    True
1    Bob   22    Male     78   False
2  Carol   19  Female     92    True
3  David   21    Male     74   False
4    Eve   20  Female     88    True

In [41]:
# TASK - 3